[
  {
    "title": "Psql Auth",
    "description": "A proof of concept for creating a custom authorization system that is database centered. Includes several PSQL functions for an authentication API and Table Policies enforcing Row Level Security based on a custom web-user authorization schema.",
    "github": "https://github.com/Idzikowski-Casey/psql-auth"
  },
  {
    "title": "Wurlde Clone",
    "description": "A clone of the very popular word guessing game Wordle! All code is original!",
    "nextLink": "/wurdle"
  },
  {
    "title": "xDD Term Linkage",
    "description": "By harrnessing the power of xDD, this application allows users to link terms for a given paper. Through the interface a user can browse already tracked terms in xDD and search for new ones. Users can view terms in paper context using the xDD API.",
    "github": "https://github.com/Idzikowski-Casey/xdd_docs",
    "nextLink": "/xdd"
  },
  {
    "title": "Macrostrat Web",
    "description": "Macrostrat Web is the public facing side of Macrostrat. This interfect is the geographical visualization of geological data in Macrostrat, Paleobio-Database, and xDD. This interface highlights the power of community level data sharing and the possible visualizations.",
    "github": "https://github.com/UW-Macrostrat/web"
  },
  {
    "title": "BirdsEye",
    "description": "BirdsEye is aimed at editing GeoJSON polygons while keeping topology. This app uses client-side interactions for geometry editing and backend logic for Topology enforcement. This application is built using Python, NodeJS, TypeScript, and PostgreSQL.",
    "github": "https://github.com/Idzikowski-Casey/column-topology"
  },
  {
    "title": "Sparrow",
    "description": "Sparrow is a data system for geochemical labs. Sparrow provides tools for labs to manage their data and its geological context. It also provides interfaces to allow third parties (community archives or Earth models) to request data directly from the labs.",
    "github": "https://github.com/EarthCubeGeochron/Sparrow"
  }
]
