{
  "work": [
    {
      "header": "Software Development Engineer I, II",
      "subtitle": "Audible, an Amazon company",
      "date": "August 2022 - Present",
      "description": "At Audible, I am working as a software engineer, developing the core Android app experience. Promoted to SDE II in Q4 of 2023, I am focusing on ways to improve App architecture by adopting industry best practices and tools (e.g unidirectional data flow, server driven UI, Jetpack Compose). My other main area of focus is improving and building upon the in-app purchasing experience."
    },
    {
      "header": "Associate Research Specialist",
      "subtitle": "Macrostrat, University of Wisconsin Madison",
      "date": "February 2021 - July 2022",
      "description": "As an Associate Research Specialist, I am applied my expertise in software development to solving data workflow problems. I lead the development on 2 full-stack web applications for streamlining data acquisition as well as lead database design on core data infrastructure. My responsibilities included updating and maintaining legacy codebases and applications."
    },
    {
      "header": "Research Intern",
      "subtitle": "Macrostrat, University of Wisconsin Madison",
      "date": "May 2020 - February 2021",
      "description": "As a research intern, I built upon my programming knowledge from my previous position. With JavaScript and React.js I helped develop the frontend of a lab-data management software called Sparrow, an NSF-funded project. My role as a developer quickly expanded beyond frontend to encompass a python backend RestAPI, python-database workflows, and managing/editing a PostgreSQL database."
    },
    {
      "header": "Student Worker",
      "subtitle": "Macrostrat, University of Wisconsin Madison",
      "date": "May 2019 - May 2020",
      "description": "As a Student Worker at the University of Wisconsin Madison, I used Python to analyze and manipulate a large dataset of archival metadata for geochemical lab. I collected my work into a set of jupyter notebooks which are now featured on the Sparrow documentation website."
    }
  ],
  "education": [
    {
      "header": "University of Wisconsin Madison",
      "subtitle": "B.S Geosciences",
      "date": "May 2020",
      "description": "At the University of Wisconsin-Madison, I assisted a then Ph.D. candidate, now Postdoc, in a 6 week long geologic field season in Western Australia. This fieldwork led to 2 years of independent undergraduate research culminating in a poster presentation at Geologic Society of America 2019. As a student I was able to combine my interest in geoscience with programming and software development."
    }
  ],
  "skills": {
    "Languages": [
      "Kotlin",
      "TypeScript",
      "Python",
      "JavaScript",
      "PostgreSQL",
      "HTML"
    ],
    "Frameworks": ["Android", "ReactJS", "NextJS", "FastAPI"],
    "Styling": ["CSS", "SASS", "Stylus"],
    "Tools": ["GIT", "Docker"]
  }
}
